УТ_для_edt.ДоставкаДеловыеЛинии/src/Documents/ДЛ_ЗаявкаНаДоставку/ДЛ_ЗаявкаНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДЛ_ЗаявкаНаДоставку</name>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаявкаНаВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказНаПеремещение</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.КорректировкаРеализации</basedOn>
  <basedOn>Document.ТранспортнаяНакладная</basedOn>
  <basedOn>Document.РасходныйОрдерНаТовары</basedOn>
  <basedOn>Document.ПриходныйОрдерНаТовары</basedOn>
  <basedOn>Document.КорректировкаПриобретения</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказНаПеремещение</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ТранспортнаяНакладная</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
        <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.ДоставкаДеловыеЛинии/src/InformationRegisters/ДЛ_ДанныеЧерновиков/ДЛ_ДанныеЧерновиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДЛ_ДанныеЧерновиков</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ДЛ_ЗаявкаНаДоставку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Documents/ДЛ_ЗаявкаНаДоставку/Forms/СписокЗаказов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	 
	
	Элементы.ОткрытьВзаиморасчеты.Видимость = РольДоступна("ДЛ_Взаиморасчеты") Или РольДоступна("АдминистраторСистемы");
	
	ИнициализироватьСтруктуруСтраниц(); 
	
	УстановитьУсловноеОформление();
	
	ПолучитьСписокЗаказов();
	
	ЗаполнитьСпискиОтборов();
	
КонецПроцедуры   

&НаСервере
Процедура ИнициализироватьСтруктуруСтраниц()
	
	Страницы = Новый Структура;
	Страницы.Вставить("ТекущаяСтраница", 1);
	Страницы.Вставить("КоличествоСтраниц",1);  
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокЗаказов()
	
	СтруктураПараметров = Новый Структура;
	
	Если ЗначениеЗаполнено(ПериодДатаСоздания.ДатаНачала) Тогда
		
		СтруктураПараметров.Вставить("НачалоПериода", НачалоДня(ПериодДатаСоздания.ДатаНачала));
	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ПериодДатаСоздания.ДатаОкончания) Тогда
		
		СтруктураПараметров.Вставить("ОкончаниеПериода", КонецДня(ПериодДатаСоздания.ДатаОкончания));
	
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(ОтборСтатусЗаказа) Тогда
				
		СтатусыЗаказа = Новый Массив;   
		
		Для Каждого СтатусСсылка Из ОтборСтатусЗаказа Цикл 
			
			Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатусСсылка.Значение, "Статус");   
			
			Если ЗначениеЗаполнено(Статус) И СтатусыЗаказа.Найти(Статус) = Неопределено Тогда
				
				СтатусыЗаказа.Добавить(Статус);	
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураПараметров.Вставить("Статус", СтатусыЗаказа);
	
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ОтборОткуда) Тогда
		
		СтруктураПараметров.Вставить("Откуда", ОтборОткуда);
	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОтборКуда) Тогда
		
		СтруктураПараметров.Вставить("Куда", ОтборКуда);
	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОтборОтправитель) Тогда
		
		СтруктураПараметров.Вставить("Отправитель", ОтборОтправитель);
	
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ОтборПолучатель) Тогда
		
		СтруктураПараметров.Вставить("Получатель", ОтборПолучатель);
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборВнутреннийНомерЗаказа) Тогда	
		
		СтруктураПараметров.Вставить("ВнутреннийНомер", ОтборВнутреннийНомерЗаказа);
	
	КонецЕсли;
	
	СтруктураПараметров.Вставить("Страница", Страницы.ТекущаяСтраница);
	
	ДанныеЗаказов =  ДЛ_ДеловыеЛинии.ПолучитьЖурналОтправок(СтруктураПараметров);    
	
	Если ДанныеЗаказов["error"] <> Неопределено Тогда 
		
		ОбщегоНазначения.СообщитьПользователю(ДанныеЗаказов["error"]["description"]);
		
		Возврат;  
		
	ИначеЕсли ДанныеЗаказов["errors"] <> Неопределено Тогда
			
		Для Каждого Ошибка Из ДанныеЗаказов["errors"] Цикл	
			
			Если Ошибка["detail"] = "Воспользуйтесь расширенным поиском" Тогда
				
				ОбщегоНазначения.СообщитьПользователю("С выбранным внутренним номером найдено более одного заказа. Используйте номер заказа для поиска.");	
				
			Иначе	
		
				ОбщегоНазначения.СообщитьПользователю(Ошибка["detail"]);   
			
			КонецЕсли;
			
		КонецЦикла;	
		
		Возврат;
		
	ИначеЕсли ДанныеЗаказов["status"] <> Неопределено И ДанныеЗаказов["status"] = "error" И ДанныеЗаказов["message"] <> Неопределено Тогда
		
		ОбщегоНазначения.СообщитьПользователю(ДанныеЗаказов["message"]);
		
		Возврат;
		
	КонецЕсли;
	
	Страницы.КоличествоСтраниц = Макс(ДанныеЗаказов["metadata"]["totalPages"], 1);  		
	
	Если Страницы.ТекущаяСтраница > Страницы.КоличествоСтраниц Тогда
		
		Страницы.ТекущаяСтраница = Страницы.КоличествоСтраниц;  
		
		ПолучитьСписокЗаказов();
		
		Возврат;
		
	КонецЕсли; 
	
	ОбновитьСписокЗаказов(ДанныеЗаказов["orders"]);		
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьСписокЗаказов(МассивЗаказов) 
	
	Список.Очистить();
	
	Для Каждого Заказ Из МассивЗаказов Цикл 		
		
		СтрокаЗаказа = Список.Добавить();
		СтрокаЗаказа.НомерЗаказа = Заказ["orderId"];
		СтрокаЗаказа.ДатаЗаказа = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(Заказ["orderedAt"]);  
		СтрокаЗаказа.Состояние = Заказ["stateName"]; 
		СтрокаЗаказа.Сумма = Заказ["totalSum"];
		СтрокаЗаказа.ОтправительНаименование = ?(ЗначениеЗаполнено(Заказ["sender"]["name"]), СтрШаблон("%1 (ИНН %2)", Заказ["sender"]["name"], Заказ["sender"]["inn"]), ""); 
		СтрокаЗаказа.ПолучательНаименование = ?(ЗначениеЗаполнено(Заказ["receiver"]["name"]), СтрШаблон("%1 (ИНН %2)", Заказ["receiver"]["name"], Заказ["receiver"]["inn"]), "");	
		СтрокаЗаказа.ПлательщикНаименование = ?(ЗначениеЗаполнено(Заказ["payer"]["name"]), СтрШаблон("%1 (ИНН %2)", Заказ["payer"]["name"], Заказ["payer"]["inn"]), "");	
		СтрокаЗаказа.Оплачен = Заказ["isPaid"]; 
		СтрокаЗаказа.СуммаНаложенногоПлатежа = Заказ["webOrderItemsSum"];
		СтрокаЗаказа.КоличествоГрузовыхМест = ?(ЗначениеЗаполнено(Заказ["freight"]), Заказ["freight"]["places"], 0); 
		СтрокаЗаказа.ВнутреннийНомерЗаказа = Заказ["orderNumber"]; 		 
		
		Если Заказ["orderedDeliveryFromAddress"] = Истина Тогда  
			
			АдресОтправки = Заказ["derival"]["address"];
			
			СтрокаЗаказа.АдресОтгрузкиПредставление = ?(ЗначениеЗаполнено(АдресОтправки), АдресОтправки, Заказ["derival"]["city"]);
			
		Иначе
			
			СтрокаЗаказа.АдресОтгрузкиПредставление = Заказ["derival"]["terminalAddress"];
			
		КонецЕсли;
		
		Если Заказ["orderedDeliveryToAddress"] = Истина Тогда
			
			АдресДоставки = Заказ["arrival"]["address"];
			
			СтрокаЗаказа.АдресДоставкиПредставление = ?(ЗначениеЗаполнено(АдресДоставки), АдресДоставки, Заказ["arrival"]["city"]);
			
		Иначе			
			
			СтрокаЗаказа.АдресДоставкиПредставление = Заказ["arrival"]["terminalAddress"];
			
		КонецЕсли;		
		
		ГрафикПеревозки = Заказ["orderDates"]; 
		ДатаДоставки = ?(ЗначениеЗаполнено(ГрафикПеревозки["arrivalToReceiver"]), ГрафикПеревозки["arrivalToReceiver"], ГрафикПеревозки["arrivalToOspReceiver"]);		
		
		СтрокаЗаказа.ДатаОтгрузки = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(Заказ["produceDate"]); 
		СтрокаЗаказа.ДатаДоставки = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(ДатаДоставки);
		СтрокаЗаказа.НачалоПлатногоХранения = ДЛ_ДеловыеЛинии.ПреобразоватьВДату(ГрафикПеревозки["warehousing"]); 
		
		ДокументЗаказа = Документы.ДЛ_ЗаявкаНаДоставку.НайтиПоРеквизиту("НомерЗаказа", Заказ["orderId"]);
		
		Если ЗначениеЗаполнено(ДокументЗаказа) Тогда	
			
			СтрокаЗаказа.ДокументЗаказа = ДокументЗаказа;
			
			КоличествоОснований = ДокументЗаказа.ДокументыОснования.Количество();
			
			Если КоличествоОснований > 0 Тогда
				
				Для Каждого Основание Из ДокументЗаказа.ДокументыОснования Цикл
					
					СтрокаЗаказа.ДокументыОснования.Добавить(Основание.Документ);	
					
				КонецЦикла; 
				
				СтрокаЗаказа.ДокументОснованиеПредставление = ?(КоличествоОснований = 1, ДокументЗаказа.ДокументыОснования[0].Документ, "Несколько");								
				
			КонецЕсли;
			
		КонецЕсли;  
		
		ДанныеДокументов = Заказ["documents"]; 
		
		ЕстьНакладная = Ложь;
		
		Если ДанныеДокументов <> Неопределено Тогда 
			
			Для Каждого ДанныеДокумента Из  ДанныеДокументов Цикл
				
				Если ДанныеДокумента["type"] = "shipping" Тогда 
					
					ЕстьНакладная = Истина;
					
					СтрокаЗаказа.НомерНакладной = ?(СтрокаЗаказа.НомерНакладной = "", ДанныеДокумента["id"], СтрокаЗаказа.НомерНакладной + "; " + ДанныеДокумента["id"]);
					
					Если СтрокаЗаказа.ВидПеревозки = "" Тогда
						
						СтрокаЗаказа.ВидПеревозки = ДанныеДокумента["serviceKind"];
						
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли; 
		
		Если Не ЕстьНакладная Тогда
			
			СтрокаЗаказа.Оплачен = Ложь;	
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция НайтиДокументЗаказаПоНомеру(НомерЗаказа)
	
	Возврат Документы.ДЛ_ЗаявкаНаДоставку.НайтиПоРеквизиту("НомерЗаказа", НомерЗаказа);		
	
КонецФункции  

&НаКлиенте
Процедура НавигацияСтраницаТекущаяСтраница(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("МаксимальныйНомерСтраницы", Страницы.КоличествоСтраниц);
	ПараметрыОткрытияФормы.Вставить("НомерСтраницы",             Страницы.ТекущаяСтраница);
	
	ОО = Новый ОписаниеОповещения("ПослеВыбораНомераСтраницы", ЭтотОбъект); 
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ПереходКСтраницеПоНомеру", ПараметрыОткрытияФормы, ЭтотОбъект,,,, ОО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНомераСтраницы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Страницы.ТекущаяСтраница = Результат; 
	
	ПолучитьСписокЗаказов();  
	
	ОбновитьНавигационноеМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОтборы(Команда) 
	
	Элементы.ГруппаОтборы.Скрыть();
	
	Если ЗначениеЗаполнено(ОтборНомерЗаказа) Тогда 
		
		ДокументЗаказа = НайтиДокументЗаказаПоНомеру(ОтборНомерЗаказа);
		
		Если ЗначениеЗаполнено(ДокументЗаказа) Тогда
			
			ПоказатьЗначение(, ДокументЗаказа);	
			
		Иначе
			
			ПараметрыОткрытияФормы = Новый Структура;	
			ПараметрыОткрытияФормы.Вставить("НомерЗаказа", ОтборНомерЗаказа);		
			
			ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ФормаДокумента", ПараметрыОткрытияФормы); 
			
		КонецЕсли;  
		
	Иначе
		
		ПолучитьСписокЗаказов();
		
		ОбновитьНавигационноеМеню();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНавигационноеМеню()
	
	Элементы.ГруппаНавигация.Доступность = Страницы.КоличествоСтраниц > 1;	
	
	Элементы.НавигацияСтраницаТекущаяСтраница.Заголовок = СтрШаблон("Страница %1 из %2", 
		Страницы.ТекущаяСтраница, 
		Страницы.КоличествоСтраниц);
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ОбновитьНавигационноеМеню(); 	
		
	ДанныеНовойВерсии = ДЛ_ДеловыеЛинииКлиент.ПроверитьНаличиеНовойВерсии(ЭтаФорма, Истина); 
	
	ВышлаНоваяВерсия = ДанныеНовойВерсии.Свойство("НоваяВерсия");
	
	Элементы.ДоступнаНоваяВерсия.Видимость = ВышлаНоваяВерсия;
	
	Если ВышлаНоваяВерсия Тогда
		
		АдресДанныеНовойВерсии = ПоместитьВоВременноеХранилище(ДанныеНовойВерсии, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоНомеруСтраницы(НомерСтраницы)
	
	Если НомерСтраницы < 1
		ИЛИ НомерСтраницы > Страницы.КоличествоСтраниц
		ИЛИ НомерСтраницы = Страницы.ТекущаяСтраница Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Страницы.ТекущаяСтраница = НомерСтраницы;
	
	ПолучитьСписокЗаказов(); 
	
	ОбновитьНавигационноеМеню();
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаПредыдущая(Команда)
	
	ПерейтиПоНомеруСтраницы(Страницы.ТекущаяСтраница - 1);
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаСледующая(Команда)
	
	ПерейтиПоНомеруСтраницы(Страницы.ТекущаяСтраница + 1);
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаПервая(Команда)
	
	ПерейтиПоНомеруСтраницы(1);
	
КонецПроцедуры

&НаКлиенте
Процедура НавигацияСтраницаПоследняя(Команда)
	
	ПерейтиПоНомеруСтраницы(Страницы.КоличествоСтраниц);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьУсловноеОформление()

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокДокументОснованиеПредставление.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДокументОснованиеПредставление");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветГиперссылкиБЭД); 	

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьФормуЗаказа(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Поле.Имя = "СписокДокументОснованиеПредставление" 
		И ТекущиеДанные.ДокументыОснования.Количество() Тогда 
		
		Если ТекущиеДанные.ДокументыОснования.Количество() = 1 Тогда 
			
			ПоказатьЗначение(, ТекущиеДанные.ДокументыОснования[0].Значение);
			
		Иначе
		
			Основания = Новый Массив;
			
			Для Каждого ТекЭлемент Из ТекущиеДанные.ДокументыОснования Цикл 
				
				Основания.Добавить(ТекЭлемент.Значение); 
				
			КонецЦикла;
			
			ОткрытьФорму("ОбщаяФорма.ДЛ_СписокПроизвольныхОбъектов",
				Новый Структура("МассивОбъектов, ЗаголовокФормы", Основания, НСтр("ru = 'Основания заказа на доставку';
																				|en = 'Delivery order bases'")),,,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
		КонецЕсли; 
		
	Иначе 
	
		ОткрытьФормуЗаказа(Список.НайтиПоИдентификатору(ВыбраннаяСтрока));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)	
	
	ПолучитьСписокЗаказов(); 
	
	ОбновитьНавигационноеМеню();

КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьФормуЗаказа(ДанныеПоЗаказу)	
	
	Если ЗначениеЗаполнено(ДанныеПоЗаказу.ДокументЗаказа) Тогда
		
		ПоказатьЗначение(, ДанныеПоЗаказу.ДокументЗаказа);	
		
	Иначе
		
		ПараметрыОткрытияФормы = Новый Структура;	
		ПараметрыОткрытияФормы.Вставить("НомерЗаказа", ДанныеПоЗаказу.НомерЗаказа);		
		
		ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ФормаДокумента", ПараметрыОткрытияФормы); 
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте 
Процедура СоздатьЗаказНаДоставкуБезОснования(Команда) 
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.КарточкаЗаказа");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодДатаСоздания(Команда)
	
	УстановитьИнтервал("ПериодДатаСоздания");
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьИнтервал(ПериодИмя)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ЭтотОбъект[ПериодИмя];
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", ПериодИмя);
	
	Оповещение = Новый ОписаниеОповещения(
		"УстановитьИнтервалЗавершение", 
		ЭтаФорма, 
		ДополнительныеПараметры);
	
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ДополнительныеПараметры.ИмяРеквизита] = ВыбранноеЗначение;	
	
КонецПроцедуры

&НаКлиенте
Процедура НеотправленныеЗаявкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураПараметров = Новый Структура("Ключ", Элемент.ТекущиеДанные.Заявка);
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.КарточкаЗаказа", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМультизаказ(Команда)   
	
	//ПараметрыФормы = Новый Структура("РежимФормы", "Мультизаказ");
	//
	//ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.СозданиеМультизаказа", ПараметрыФормы);
	
	ОткрытьФорму("Обработка.ДЛ_Мультизаявка.Форма.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНеотправленнуюЗаявку(Команда)
	
	УдалитьНеотправленнуюЗаявкуНаСервере(Элементы.НеотправленныеЗаявки.ТекущиеДанные.Заявка);
	
	Элементы.НеотправленныеЗаявки.Обновить();
	
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура УдалитьНеотправленнуюЗаявкуНаСервере(Заявка)    
	
	Черновик = РегистрыСведений.ДЛ_ДанныеЧерновиков.СоздатьМенеджерЗаписи();
	Черновик.Заявка = Заявка;
	Черновик.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПреалерт(Команда)
	
	ПараметрыФормы = Новый Структура("РежимФормы", "Преалерт");
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.СозданиеМультизаказа", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьАртикулыГрузовыхМест(Команда)
	
	МассивЗаказов = ПолучитьМассивНомеровЗаказовВыделенныхСтрок(); 
	
	ПередатьАртикулыДляЗаказов(МассивЗаказов);
	
КонецПроцедуры  

&НаКлиенте
Функция ПолучитьМассивНомеровЗаказовВыделенныхСтрок() 
	
	Результат = Новый Массив;
	
	Для Каждого ВыбраннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл  
		
		СтрокаСписка = Список.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		Результат.Добавить(Новый Структура("НомерЗаказа, КоличествоМест", СтрокаСписка.НомерЗаказа, СтрокаСписка.КоличествоГрузовыхМест)); 		
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередатьАртикулыДляЗаказов(МассивЗаказов)  	
	
	Если МассивЗаказов.Количество() > 0 Тогда	
		
		СтруктураПараметров = Новый Структура("НомерЗаказа, КоличествоМест");
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, МассивЗаказов[0]);
		
		МассивЗаказов.Удалить(0);
		
		ОО = Новый ОписаниеОповещения("ПослеПередачиАртикуловГрузовыхМест", ЭтотОбъект, МассивЗаказов);
	
		ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.АртикулыГрузовыхМест", СтруктураПараметров, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПередачиАртикуловГрузовыхМест(Результат, МассивЗаказов) Экспорт
	
	ПередатьАртикулыДляЗаказов(МассивЗаказов);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьГрузовыхМест(Команда)
	
	ПечатьЭтикетки("ПечатьЭтикеткиГруз");
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораФорматаЭтикетки(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		#Если НЕ ВебКлиент Тогда		
				
		МассивBase64 = ПолучитьЭтикетки(Результат, ДополнительныеПараметры.ТипПечати, ДополнительныеПараметры.МассивЗаказов); 
		
		Если ЗначениеЗаполнено(МассивBase64) Тогда  
			
			Для Каждого ОтветBase64 Из МассивBase64 Цикл 
				
				ДвоичныеДанные = Base64Значение(ОтветBase64);
				
				ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
				
				ДвоичныеДанные.Записать(ИмяФайла);
				
				ЗапуститьПриложение(ИмяФайла); 
				
			КонецЦикла; 						
			
		КонецЕсли;
		
		#КонецЕсли 
		
	КонецЕсли;			
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьЭтикетки(ФорматЭтикетки, ТипПечати, МассивЗаказов)  
	
	Результат = Новый Массив;
	
	Для Каждого Заказ Из МассивЗаказов Цикл
		
		СтруктураОтвета = ДЛ_ДеловыеЛинии.ПолучитьЭтикетки(Заказ.НомерЗаказа, ФорматЭтикетки, ТипПечати); 
		
		Если СтруктураОтвета["data"] <> Неопределено Тогда
			
			Если СтруктураОтвета["data"].Количество() > 0 Тогда				
				
				Для Каждого ЗаписьДанных Из СтруктураОтвета["data"] Цикл
					
					Результат.Добавить(ЗаписьДанных["base64"]);	
					
				КонецЦикла;    				
				
			КонецЕсли;	
			
		КонецЕсли; 
		
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПечатьСопроводительныеДокументы(Команда)  
	
	ПечатьЭтикетки("ПечатьЭтикеткиДокументы"); 	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПечатьЭтикетки(ТипПечати)  
	
	СтруктураПараметров = Новый Структура("ТолькоВыборФормата", Истина);  
	
	МассивЗаказов = ПолучитьМассивНомеровЗаказовВыделенныхСтрок();
	
	ДополнительныеПараметры = Новый Структура("ТипПечати, МассивЗаказов", ТипПечати, МассивЗаказов);
	
	ОО = Новый ОписаниеОповещения("ПослеВыбораФорматаЭтикетки", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.ВыборЭтикетки", СтруктураПараметров, ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьЛогиapiЗапросов(Команда)
	
	ДЛ_ДеловыеЛинииКлиент.ОткрытьЛоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусЗаказаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ОО = Новый ОписаниеОповещения("ОтборСтатусЗаказаНачалоВыбораЗавершение", ЭтаФорма); 
	
	ПараметрыОткрытия = Новый Структура;			
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);  
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.ДЛ_СтатусыЗаказа.ФормаВыбора", ПараметрыОткрытия,	ЭтаФорма,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтборСтатусЗаказаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОтборСтатусЗаказа.ЗагрузитьЗначения(Результат); 
		
	КонецЕсли; 
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры 

&НаКлиенте
Процедура ДоступнаНоваяВерсия(Команда)
	
	ДанныеНовойВерсии = ПолучитьИзВременногоХранилища(АдресДанныеНовойВерсии);
	
	ОткрытьФорму("ОбщаяФорма.ДЛ_ОповещениеОНовойВерсии", ДанныеНовойВерсии, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиОтборов()
	
	ДанныеКудаОткуда = ДЛ_ДеловыеЛинии.ПолучитьСписокГородовЗаказов();  
	
	Если ДанныеКудаОткуда["data"] <> Неопределено Тогда  
		
		Если ДанныеКудаОткуда["data"]["derival_cities"] <> Неопределено Тогда
		
			Элементы.ОтборОткуда.СписокВыбора.ЗагрузитьЗначения(ДанныеКудаОткуда["data"]["derival_cities"]);
		
		КонецЕсли; 
		
		Если ДанныеКудаОткуда["data"]["arrival_cities"] <> Неопределено Тогда
			
			Элементы.ОтборКуда.СписокВыбора.ЗагрузитьЗначения(ДанныеКудаОткуда["data"]["arrival_cities"]);			    
			
		КонецЕсли;	
		
	КонецЕсли;  
	
	ДанныеОтправительПолучатель = ДЛ_ДеловыеЛинии.ПолучитьСписокКонтрагентовЗаказов();
	
	Если ДанныеОтправительПолучатель["data"] <> Неопределено Тогда  
		
		Если ДанныеОтправительПолучатель["data"]["senders"] <> Неопределено Тогда
		
			Элементы.ОтборОтправитель.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивНаименованийКонтрагентов(ДанныеОтправительПолучатель["data"]["senders"]));
		
		КонецЕсли; 
		
		Если ДанныеОтправительПолучатель["data"]["receivers"] <> Неопределено Тогда
			
			Элементы.ОтборПолучатель.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивНаименованийКонтрагентов(ДанныеОтправительПолучатель["data"]["receivers"]));			    
			
		КонецЕсли;	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивНаименованийКонтрагентов(МассивСоответсвий)
	
	Результат = Новый Массив;
	
	Для Каждого Контрагент Из МассивСоответсвий Цикл  
		
		Результат.Добавить(Контрагент["name"]);	
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДополнительныеОтборы(Команда)
	
	ВидимостьГруппы = Не Элементы.ГруппаОтборыДополнительные.Видимость;
	
	Элементы.ГруппаОтборыДополнительные.Видимость = ВидимостьГруппы;
	Элементы.ДополнительныеОтборы.Заголовок = ?(ВидимостьГруппы, "˄ Скрыть доп. фильтры", "˅ Показать доп. фильтры");    	
	
	ПереместитьГруппуКнопокОтборов(ВидимостьГруппы); 
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьОтборы(Команда)
	
	ОтборНомерЗаказа = "";
	ОтборВнутреннийНомерЗаказа = "";
	ОтборСтатусЗаказа.Очистить();
	ПериодДатаСоздания.ДатаНачала = '00010101';
	ПериодДатаСоздания.ДатаОкончания = '00010101';
	ОтборКуда = "";
	ОтборОткуда = "";
	ОтборОтправитель = "";
	ОтборПолучатель = "";	
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	ПолучитьСписокЗаказов();	
	ОбновитьНавигационноеМеню();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьОтображениеКнопкиСброситьОтборы()	
	
	КоличествоОтборов = ?(ЗначениеЗаполнено(ОтборВнутреннийНомерЗаказа), 1, 0) 
		+ ?(ЗначениеЗаполнено(ОтборНомерЗаказа), 1, 0)
		+ ?(ОтборСтатусЗаказа.Количество() > 0, 1, 0)
		+ ?(ЗначениеЗаполнено(ПериодДатаСоздания.ДатаНачала) Или ЗначениеЗаполнено(ПериодДатаСоздания.ДатаОкончания), 1, 0)
		+ ?(ЗначениеЗаполнено(ОтборКуда), 1, 0)
		+ ?(ЗначениеЗаполнено(ОтборОткуда), 1, 0)
		+ ?(ЗначениеЗаполнено(ОтборОтправитель), 1, 0)
		+ ?(ЗначениеЗаполнено(ОтборПолучатель), 1, 0);
	
	Элементы.СброситьОтборы.Видимость = КоличествоОтборов <> 0; 	
	Элементы.СброситьОтборы.Заголовок = СтрШаблон("❌ Сбросить все (%1)", КоличествоОтборов); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерЗаказаПриИзменении(Элемент)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНомерЗаказаОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВнутреннийНомерЗаказаПриИзменении(Элемент)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВнутреннийНомерЗаказаОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусЗаказаОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаСозданияПриИзменении(Элемент)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПолучательОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтправительОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОткудаОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКудаОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПолучательПриИзменении(Элемент)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтправительПриИзменении(Элемент)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОткудаПриИзменении(Элемент)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКудаПриИзменении(Элемент)
	
	ОбновитьОтображениеКнопкиСброситьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПолучательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДЛ_ДеловыеЛинииКлиент.АвтоПодборПоПодстроке(Элемент, Текст, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтправительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДЛ_ДеловыеЛинииКлиент.АвтоПодборПоПодстроке(Элемент, Текст, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОткудаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДЛ_ДеловыеЛинииКлиент.АвтоПодборПоПодстроке(Элемент, Текст, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКудаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДЛ_ДеловыеЛинииКлиент.АвтоПодборПоПодстроке(Элемент, Текст, ДанныеВыбора);
	
КонецПроцедуры 

&НаСервере
Процедура ПереместитьГруппуКнопокОтборов(ВидимостьГруппы)
	
	Элементы.Переместить(Элементы.ГруппаОтборыКнопки, ?(ВидимостьГруппы, Элементы.ГруппаОтборыДополнительные, Элементы.ГруппаОтборыОсновные));
	
КонецПроцедуры

&НаКлиенте
Процедура Маркировка(Команда)  
	
	ПараметрыОткрытия = Новый Структура;			
	ПараметрыОткрытия.Вставить("МассивЗаказов", ПолучитьМассивНомеровЗаказовВыделенныхСтрок());	
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.Маркировка", ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВзаиморасчеты(Команда)
	
	ОткрытьФорму("Обработка.ДЛ_Взаиморасчеты.Форма.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура Поддержка(Команда)  
	
	ОткрытьФорму("Документ.ДЛ_ЗаявкаНаДоставку.Форма.Поддержка",, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
